import com.sun.org.apache.xml.internal.dtm.ref.DTMDefaultBaseTraversers;

import java.util.Scanner;
import java.util.regex.Pattern;

public class mainhomework {





    public static void main (String[] args) {
/*        1.
        Объявить переменную name типа String.
                Сразу же в строке объявления присвоить ей какое-нибудь значение.
                Выведи на экран переменную name.*/
//        String z="name";
//            //int name=1;
//        System.out.println("name");
//

       /* 2.
        Написать программу, которая считывает с клавиатуры целое число a и выводит квадрат этого числа (a * a).
                Для считывания данных с клавиатуры использовать метод nextInt() класса Scanner.
Требования:
1. Программа должна выводить текст.
2. В программе необходимо создать объект типа Scanner.
3. Программа должна считывать данные с клавиатуры.
4. Программа должна выводить квадрат считанного числа.

                */

//        System.out.println("Input ONLY digit");
//        Scanner scan = new Scanner(System.in);
//        int number = scan.nextInt();//write data from keyboard to variable "number"
//        //number = (double) number;
//        String al = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
//
//        //String character = in.next();
//
//        if (number >= 0) {
//            System.out.println("You have:" + number * number);
//        } else if (number < 0) {
//            System.out.println("Less than 0 and you get: " + number * number);
//        } else  {
//            System.out.println("Input only digits");
//        }








    }


}
